Repository: Almost-Senseless-Coder/cargo-i18n
Catalog: i18n/po/*/cargo_i18n.po
Languages: ru

source: Cannot load i18n config file: {0}.
ru: Не удается загрузить i18n файл настроек: {0}.

source: There is no i18n config called "{0}" present in this crate "{1}".
ru: Настройки i18n с этим именем "{0}" отсутствует в этом ящике "{1}".

source: There is no gettext config available the i18n config "{0}".
ru: Настройка gettext недоступна для настройки i18n "{0}".

source: Trouble reading file "{0}".
ru: Ошибка чтения файла "{0}".

source: There was an error while parsing an i18n config file "{0}".
ru: Произошла ошибка при анализе i18n файла настроек "{0}".

source: The path ("{0}") for {1} {2} does not have valid a utf-8 encoding.
ru: Путь ("{0}") для {1} {2} не имеeт допустимой кодировки utf-8.

source: The path {0} does not exist on the filesystem.
ru: Путь {0} не существует в файловой системе.

source: Cannot create the directory "{0}" because: "{1}".
ru: Не удалось создать католог "{0}" так как "{1}".

source: The path "{0}" is not inside the "{1}" directory {2}.
ru: Путь "{0}" не находится "{1}" в каталоге {2}.

source: The "{0}" command was unable to start.
ru: Команду "{0}" не удалось запустить.

source: The "{0}" command had a problem waiting for output.
ru: У команды "{0}" возникла проблема при ожидании вывода.

source: The "{0}" command reported that it was unsuccessful.
ru: Команда "{0}" сообщила что она не удалась.

source: A Cargo subcommand to extract and build localization resources.
ru: Подкоманда Cargo для извлечения и построения ресурсов локализации.

source: {0} This command reads the "i18n.toml" config in your crate root, and based on the configuration there, proceeds to extract localization resources, and build them. If you are using the gettext localization system, you will need to have the following gettext tools installed: "msgcat", "msginit", "msgmerge" and "msgfmt". You will also need to have the "xtr" tool installed, which can be installed using "cargo install xtr".
ru: {0} Эта команда читает "i18n.toml" программа корневой крэйтера, основываясь на конфигурации, продолжает извлекать ресурсы локализации и собирать их. Если вы используете систему локализации gettext, вам необходимо установить следующие инструменты gettext: "msgcat", "msginit", "msgmerge" и "msgfmt". Вам также необходимо установить инструмент «xtr», который можно установить с помощью "cargo install xtr".
